export interface Counts {
  [key: string]: number
}

export interface LineDataItem {
  date: Date
  count: number
}

export interface PieDataItem {
  name: string
  value: number
}

export const fireTypeList = [
  '办公场所',
  '厂房',
  '学校',
  '居住场所',
  '其他',
  '商业场所',
  '公共娱乐场所',
  '纯餐饮场所',
  '石油化工企业',
  '轿车',
  '物资仓储场所',
  '工地',
  '宾馆、饭店、招待所',
  '通信场所',
  '货车',
  '汽车库',
  '垃圾堆',
  '交通枢纽（站）',
  '客车',
  '公园',
  '露天农副业场所',
  '加油加气站充电站',
  '宗教场所',
  '金融交易场所',
  '医疗机构',
  '养老院',
  '露天堆垛',
  '室外集贸市场',
  '科研试验场所',
  '室内农副业场所',
  '特种车',
  '城市轨道交通工具',
  '体育场馆',
  '文物古建筑',
  '会议、展览中心',
  '船舶',
  '道路绿化带、隔离带',
  '室外独立生产设施设备',
  '电动助力车（三轮车、自行车）',
  '垃圾箱',
  '森林',
  '废品回收场所',
  '修车库',
  '摩托车',
  '垃圾场',
  '文博馆（图书馆、博物馆、档案馆等）'
]
